# Pandas

- pandas is an open-source, BSD-licensed Python library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.
- pandas is built on top of NumPy library.
- pandas is well suited for many different kinds of data:
- Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
- Ordered and unordered (not necessarily fixed-frequency) time series data.
- Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
- Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure

1 Convert list into series of elements
==

In [1]:
import numpy as np
import pandas as pd
data_n = [21,23,24,25,26]
pd.Series(data_n)

0    21
1    23
2    24
3    25
4    26
dtype: int64

In [2]:
import numpy as np
import pandas as pd
my_data=[10,20,30,40,50]
pd.Series(my_data)
# convert element lists into series of elements, which have index from 0—4

0    10
1    20
2    30
3    40
4    50
dtype: int64

2 Convert dictionary into series of elements 
==

In [3]:
d={'a':10,'b':20,'c':30,'d':40}      
#dictionary keys act as index and values with every key act as series values
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

3 Addition of two series
==

In [4]:
ser1=pd.Series([1,2,3,4],["India","China","Nepal","Russia"])   
#create series from 1—4 with index as country names
print(ser1)

ser2=pd.Series([1,2,5,4],["India","China","Bhutan","Russia"])
print("\n")
print(ser2)

ser1+ser2

India     1
China     2
Nepal     3
Russia    4
dtype: int64


India     1
China     2
Bhutan    5
Russia    4
dtype: int64

Bhutan    NaN
China     4.0
India     2.0
Nepal     NaN
Russia    8.0
dtype: float64

4 Converting into data frame and indexing
==

In [5]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}

df = pd.DataFrame((data), index=['rank1','rank2','rank3','rank4'])
print (df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

5 Create Dataframe & Select columns
==

In [6]:
from numpy.random import randn
import pandas as pd

np.random.seed(10)
df=pd.DataFrame(randn(5,4),['A','B','C','D','E.'],["W","X","Y","Z"])

#generate random number for 5 rows and 4 columns
print(df)
print("\n")
print(df["W"])
print("\n")

df[["W","Z"]]

           W         X         Y         Z
A   1.331587  0.715279 -1.545400 -0.008384
B   0.621336 -0.720086  0.265512  0.108549
C   0.004291 -0.174600  0.433026  1.203037
D  -0.965066  1.028274  0.228630  0.445138
E. -1.136602  0.135137  1.484537 -1.079805


A     1.331587
B     0.621336
C     0.004291
D    -0.965066
E.   -1.136602
Name: W, dtype: float64

           W         Z
A   1.331587 -0.008384
B   0.621336  0.108549
C   0.004291  1.203037
D  -0.965066  0.445138
E. -1.136602 -1.079805

6 Data Manipulation: Data selection
==

In [7]:
df1=df.drop("W",axis=1) #,inplace=True) #droping column indexed w
print(df1)

print("\n",df.loc['A'])   # fetch particular row from dataset having index ‘A’


print("\n",df.iloc[4])     # fetch 5th row from dataset

           X         Y         Z
A   0.715279 -1.545400 -0.008384
B  -0.720086  0.265512  0.108549
C  -0.174600  0.433026  1.203037
D   1.028274  0.228630  0.445138
E.  0.135137  1.484537 -1.079805

 W    1.331587
X    0.715279
Y   -1.545400
Z   -0.008384
Name: A, dtype: float64

 W   -1.136602
X    0.135137
Y    1.484537
Z   -1.079805
Name: E., dtype: float64

In [8]:
df.loc[['A','B'],['W',"X"]] # fetch a subset of data from given dataset

          W         X
A  1.331587  0.715279
B  0.621336 -0.720086

In [9]:
print(df > 0)

        W      X      Y      Z
A    True   True  False  False
B    True  False   True   True
C    True  False   True   True
D   False   True   True   True
E.  False   True   True  False

In [10]:
print(df[df>0]) # fetch original values

           W         X         Y         Z
A   1.331587  0.715279       NaN       NaN
B   0.621336       NaN  0.265512  0.108549
C   0.004291       NaN  0.433026  1.203037
D        NaN  1.028274  0.228630  0.445138
E.       NaN  0.135137  1.484537       NaN

In [11]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y',"Z"])  
print(df)

print("\n",df[df['W']>0]) 

print("\n",df[df['W']>0][['X','Y']])


# fetch out desired frame of X & Y from dataset, for those rows where value is more # than 0 in ‘W’ column

df.reset_index()  #assign natural index

df.set_index("Z")    #set ‘Z’ column as index value

          W         X         Y         Z
A -1.977728 -1.743372  0.266070  2.384967
B  1.123691  1.672622  0.099149  1.397996
C -0.271248  0.613204 -0.267317 -0.549309
D  0.132708 -0.476142  1.308473  0.195013
E  0.400210 -0.337632  1.256472 -0.731970

           W         X         Y         Z
B  1.123691  1.672622  0.099149  1.397996
D  0.132708 -0.476142  1.308473  0.195013
E  0.400210 -0.337632  1.256472 -0.731970

           X         Y
B  1.672622  0.099149
D -0.476142  1.308473
E -0.337632  1.256472

                  W         X         Y
Z
 2.384967 -1.977728 -1.743372  0.266070
 1.397996  1.123691  1.672622  0.099149
-0.549309 -0.271248  0.613204 -0.267317
 0.195013  0.132708 -0.476142  1.308473
-0.731970  0.400210 -0.337632  1.256472

7 Data Manipulation: Drop missing elements
==

## import pandas as pd
d={'A':[1,2,np.NaN], 'B':[1,np.NaN,np.NaN],'C':[1,2,3]}     
# np.NaN is the missing element in DataFrame

df=pd.DataFrame(d)
print(df)

#print("\n",df.dropna()) #pandas would drop any row with missing value

#print(df.dropna(axis=1))   		#drop column with NULL value

print("\n",df.dropna(thresh=1))

In [12]:
d={'A':[1,2,np.NaN,np.NaN,np.NaN], 'B':[1,2,3,np.NaN,np.NaN],'C':[1,2,3,np.NaN,np.NaN],'D':[1,2,3,4,np.NaN]}
d
df=pd.DataFrame(d) 
print(df)

print("\n",df.dropna()) #pandas would drop any row with missing value
print(df.dropna(axis=1)) #drop column with NULL value
print("\n",df.dropna(thresh=4,axis=0))
print("\n",df.isna()) #shows null values
print("\n",df.notna())#shows not null values
print("\n",df.dropna(subset=["D"]))#drop the row across column D
print("\n",df.dropna(how="all")) #drop if all the values in rows or columns are NaN

     A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0
2  NaN  3.0  3.0  3.0
3  NaN  NaN  NaN  4.0
4  NaN  NaN  NaN  NaN

      A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

      A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0

        A      B      C      D
0  False  False  False  False
1  False  False  False  False
2   True  False  False  False
3   True   True   True  False
4   True   True   True   True

        A      B      C      D
0   True   True   True   True
1   True   True   True   True
2  False   True   True   True
3  False  False  False   True
4  False  False  False  False

      A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0
2  NaN  3.0  3.0  3.0
3  NaN  NaN  NaN  4.0

      A    B    C    D
0  1.0  1.0  1.0  1.0
1  2.0  2.0  2.0  2.0
2  NaN  3.0  3.0  3.0
3  NaN  NaN  NaN  4.0

8 Data Manipulation: Filling suitable value 
==

In [13]:
import pandas as pd
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [14]:
print(df.fillna(value='FILL VALUE'))    		#NaN is replaced by value=FILL VALUE 

print(df['A'].fillna(value=df["A"].mean()))   #Select column "A" and fill the missing value with mean value of the column A OR

print(df['A'].fillna(value=df['A'].std()))   #Select column "A" and fill the missing value with standard deviation value of the column A

            A           B           C  D
0  FILL VALUE         2.0  FILL VALUE  0
1         3.0         4.0  FILL VALUE  1
2  FILL VALUE  FILL VALUE  FILL VALUE  5
3  FILL VALUE         3.0  FILL VALUE  4
0    3.0
1    3.0
2    3.0
3    3.0
Name: A, dtype: float64
0    NaN
1    3.0
2    NaN
3    NaN
Name: A, dtype: float64

9 Replacing NA with a scalar value is equivalent behavior of the fillna() function.
==
- Many times, we have to replace a generic value with some specific value. 
- We can achieve this by applying the replace method.

In [15]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print(df)
print("\n")
print (df.replace({1000:10,2000:60}))

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60


   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

10 Groupby() function
==

In [55]:
data = {"Company": [ "CompA", "CompA", "CompB", "CompB", "CompC", "CompC"],
              "Person": ["Rajesh", "Pradeep", "Amit", "Rakesh", "Suresh", "Raj"],
              "Sales": [200, 120, 340, 124, 243, 350]}






df=pd.DataFrame(data)	
print(df)

comp = df.groupby("Company").std()
comp


#comp=df.groupby("Person").mean() 
#print(comp)
#comp1=df.groupby("Company")	#grouping done using label name “Company”
#comp1.std()    				#apply standard deviation on grouped data

  Company   Person  Sales
0   CompA   Rajesh    200
1   CompA  Pradeep    120
2   CompB     Amit    340
3   CompB   Rakesh    124
4   CompC   Suresh    243
5   CompC      Raj    350

              Sales
Company
CompA     56.568542
CompB    152.735065
CompC     75.660426

In [59]:
data = {"Company": [ "CompA", "CompA", "CompB", "CompB", "CompC", "CompC"],
              "Person": ["Rajesh", "Pradeep", "Amit", "Rakesh", "Suresh", "Raj"],
              "Sales": [200, 120, 340, 124, 243, 350]}


df=pd.DataFrame(data)	
df


df1=df.groupby("Company").sum().loc["CompC"]
df1                                     #.loc["CompB"]
# group data by ‘company’ label, apply sum function such that all data of same company gets added and then fetch Company “CompB” value after summation

Sales    593
Name: CompC, dtype: int64

11 Finding maximum value in each label
==

In [60]:
data = {"Company": [ "CompA", "CompA", "CompB", "CompB", "CompC", "CompC"],
              "Person": ["Rajesh", "Pradeep", "Amit", "Rakesh", "Suresh", "Raj"],
              "Sales": [200, 120, 340, 124, 243, 350]}
df=pd.DataFrame(data)	
df
df.groupby("Company").min()	
#group dataset based on ‘company’ label and pick maximum value in each label

          Person  Sales
Company
CompA    Pradeep    120
CompB       Amit    124
CompC        Raj    243

12 Finding unique value & number of occurrence from Dataframe
==

In [63]:
df = pd.DataFrame({"col1":[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi',"xyz"]})
# col1, col2 & col3 are column labels, each column have their own values
print(df)
print("\n")
df1=df['col2'].unique()		#fetches the unique values available in column
print(df1)

print("\n")


df2=df['col2'].value_counts()	# count number of occurance of every value
print(df2)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz


[444 555 666]


444    2
666    1
555    1
Name: col2, dtype: int64

13 Statistical Functions
==
i. The  pct_change() function compares every element with its prior element and computes the change percentage.

In [68]:
import numpy as np


s = pd.Series([1,2,3,4,5,4])      
print(s)

print (s.pct_change())

print("\n")
df = pd.DataFrame(np.random.randn(5, 2))
print(df)
print (df.pct_change())

0    1
1    2
2    3
3    4
4    5
5    4
dtype: int64
0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64


          0         1
0 -0.221793  1.339926
1  0.029310  1.985386
2  1.447166 -0.287629
3 -1.359311 -0.048041
4 -0.480787  0.377753
           0         1
0        NaN       NaN
1  -1.132149  0.481713
2  48.374953 -1.144873
3  -1.939292 -0.832975
4  -0.646301 -8.863086

ii. Covariance is applied on series data. The Series object has a method cov() to compute covariance between series objects. NA will be excluded automatically.

In [74]:

import numpy as np

s1 = pd.Series(np.random.randn(10))

s2 = pd.Series(np.random.randn(10))

print (s1.cov(s2))

-0.5077946963592819

iii. Correlation shows the linear relationship between any two array of values, available in series. 
There are multiple methods to compute the correlation like pearson(default), spearman and kendall.

In [76]:
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.random.randn(10, 5), columns=['a', 'b', 'c', 'd', 'e'])
frame
print (frame.corr())

          a         b         c         d         e
a  1.000000  0.150791 -0.073069  0.561729 -0.154842
b  0.150791  1.000000  0.245943  0.230347  0.002885
c -0.073069  0.245943  1.000000 -0.006091  0.035207
d  0.561729  0.230347 -0.006091  1.000000 -0.214851
e -0.154842  0.002885  0.035207 -0.214851  1.000000

iv. Data Ranking produces ranking for each element in the array of elements; large value assigned higher rank. 
In case of ties, assigns the mean rank.

In [78]:
import pandas as pd
import numpy as np
s = pd.Series(np.random.randn(5), index=list('abcde'))

s['d'] = s['b'] # so there's a tie

print (s)

print (s.rank())

a    0.884368
b   -1.386823
c    0.653662
d   -1.386823
e    0.618949
dtype: float64
a    5.0
b    1.5
c    4.0
d    1.5
e    3.0
dtype: float64

14 Fetch Data from CSV file or Excel File
==

In [79]:
import numpy as np
import pandas as pd
df = pd.read_csv('Batch.csv') 
print(df)

         student_name                  student_email      mobile branch  \
0      SANSKRITI JAIN    sanskritijain1012@gmail.com  8700625647    CSE
1   VAISHNAVI SHEORAN      vishusheoran123@gmail.com  9315191765    CSE
2       BHUMIKA VERMA      bhumikabhumi543@gmail.com  8178941195    CSE
3        PRIYA KUMARI            ps5052922@gmail.com  8595382773    CSE
4        KANIKA JOSHI          kanikaj211@gmail.com   8860766928    CSE
5          SWATI GOUR           gourdswati@gmail.com  9711367393    CSE
6    ANUKRITI CHAUHAN  anukritichauhan0808@gmail.com  9810790397    CSE
7       Harshikha Pal         23harshu2000@gmail.com  9315873683    CSE
8        Rajni Kumari       rajnimehta7838@gmail.com  8506828515    CSE
9               Sarah          sarahsid97@gmail.com   7838477586    CSE
10      Aastha Gautam     aasthagautam2000@gmail.com  9910952743    CSE
11              Komal         komalpal0000@gmail.com  8368126935    CSE
12       Mansi Gautam      gautammansi030@gmail.com   8587022989    CSE
13     Prabhleen Kaur  prabhleenkaurkapur@gmail.com   9711941316    CSE
14      Vibha Pandita           vibha.vp02@gmail.com  9682159768    CSE
15              Yukti       yuktimelty2001@gmail.com  7011745977    CSE
16             Anchal    anchalchaudhary00@gmail.com  9354500474    CSE
17    Prachi Bajpayee  prachibajpayee53915@gmail.com  9250214655    CSE
18     Muskan Rautela    muskanrautela0808@gmail.com  8810627719    CSE
19      Ruchita Singh         rsingh110055@gmail.com  9625536241    ECE
20  Geetanjali mishra    geetanjali1612002@gmail.com  8800730780    ECE
21        Aleena Umar          aleenaumar4@gmail.com  8383869730    ECE
22       HREEYA SINGH             hreeya07@gmail.com  9310259515    ECE
23             Sakshi      sakshikishore01@gmail.com  9870503850    ECE
24             Khyati          khayati.048@gmail.com  9650426827    ECE
25       Akansha Jain       2112000akansha@gmail.com  9625267596    ECE
26      Nishu Kumari        nishudubey2000@gmail.com  9582123329    ECE
27               Neha       nehasingh76059@gmail.com  7303439307    ECE
28    Jigyaasa Mahor        jigyamahor3801@gmail.com  9871372048    ECE
29          V Monisha      vrajeshwari2604@gmail.com  8076560532    ECE

    access    cgpa year
0   Laptop   9.323    P
1   Laptop    76.6    P
2   Mobile       8    P
3   Laptop     7.8    P
4   Laptop   8.439    P
5   Laptop   7.195    P
6   Laptop       9    P
7   Laptop       8    F
8   Laptop     6.8    F
9   Laptop   8.892    F
10  Laptop     7.9    F
11  Laptop     8.1    F
12  Laptop   8.117    F
13  Laptop   8.299    F
14  Laptop       8    F
15  Laptop    8.35    F
16  Laptop     7.9    F
17  Laptop       8    F
18  Laptop    8.35    F
19  Laptop     7.5    P
20  Laptop     8.4    P
21  Laptop     8.7    F
22  Laptop   9.172    P
23  Laptop   8.169    P
24  Laptop     7.8    P
25  Mobile     8.3    P
26  Laptop  80.47%    P
27  Mobile      70    P
28  Laptop    65.5    F
29  Laptop     6.8    P

In [80]:
df=pd.read_excel("assessment.xlsx")
print(df)

         Student Name  Session Quiz   Grades  Unit Assessment  Grades.1
0      Sanskriti Jain            4.0     NaN             12.0       NaN
1        HREEYA SINGH            4.0     NaN             11.0       NaN
2        Nishu Kumari            4.0     NaN             13.0       NaN
3              Khyati            NaN     NaN              NaN       NaN
4   Vaishnavi sheoran            NaN     NaN              NaN       NaN
5        Akansha Jain            NaN     NaN              NaN       NaN
6          swati gour            NaN     NaN              NaN       NaN
7        Kanika Joshi            NaN     NaN              NaN       NaN
8               Yukti            NaN     NaN              NaN       NaN
9       Bhumika Verma            NaN     NaN              NaN       NaN
10              Sarah            NaN     NaN              NaN       NaN
11             sakshi            NaN     NaN              NaN       NaN
12         Neha Singh            NaN     NaN              NaN       NaN
13       Rajni Kumari            NaN     NaN              NaN       NaN
14     Prabhleen Kaur            NaN     NaN              NaN       NaN
15      Ruchita Singh            NaN     NaN              NaN       NaN
16       Mansi Gautam            NaN     NaN              NaN       NaN
17      Aastha Gautam            NaN     NaN              NaN       NaN
18    Prachi bajpayee            NaN     NaN              NaN       NaN
19       Priya Kumari            NaN     NaN              NaN       NaN
20      Vibha Pandita            NaN     NaN              NaN       NaN
21   Anukriti Chauhan            NaN     NaN              NaN       NaN
22             Anchal            NaN     NaN              NaN       NaN
23              Komal            NaN     NaN              NaN       NaN
24      Harshikha Pal            NaN     NaN              NaN       NaN
25  Geetanjali mishra            NaN     NaN              NaN       NaN
26          V Monisha            NaN     NaN              NaN       NaN
27     Muskan Rautela            NaN     NaN              NaN       NaN
28        Aleena Umar            NaN     NaN              NaN       NaN
29           Jigyaasa            NaN     NaN              NaN       NaN
30           Sushmita            NaN     NaN              NaN       NaN

15 Save Data frame into CSV file or Excel file
==

In [81]:
df1= df.to_csv('Example.csv',index=False)
df1